const ChannelID = {
    META: "822354240713261068",
    Nabor: "1181219422518657065",
    ClanRequest: "1105643298787438622",

    Control: '1181219422518657065',
    Assist: '1181219422518657065',
    Event: '1181219422518657065',
    Mafia: '1181219422518657065',
    Bunker: '1181219422518657065',
    Close: '1181219422518657065',
    Creative: '1181219422518657065',
    Content: '1181219422518657065',

    EruditRequest: '',
    CloseRoleRequest: '',
    MafiaRoleRequest: '',
    OblachkoRequest: '',
    DubberRequest: '',
    MusicRequest: '',
    PainterRequest: '',
    ReaderRequest: '',

    //CommentRequest: "1107977095851810850"
}

const Utility = {
    colorDiscord: 2829617,
    colorYellow: 16758784,
    colorRed: 13697024,
    colorGreen: 435462,

    iconMETA: 'https://cdn.discordapp.com/attachments/1129389401630314507/1183105645432537199/icon.gif?ex=65871ffe&is=6574aafe&hm=3c59fb96f22bd1567eaa7251d1d0bcc9b0d49215a3fe0af89d6be60929e69a07&'
}
const Url = {
    ClanRules: "https://discord.com/channels/822354240713261068/1143999035095646218",
    ClanHelp: "https://discord.com/channels/822354240713261068/1143999117832491038",

    EventRules: "https://discord.com/channels/822354240713261068/1144618478553276476",
    EventHelp: "https://discord.com/channels/822354240713261068/1144618526590640229",

    CreativeRules: "https://discord.com/channels/822354240713261068/1143562380882751659",
    CreativeHelp: "https://discord.com/channels/822354240713261068/1143562420615401634",
}

const RoleID = {
    ControlMentor: '',
    AssistMentor: '1154731145552986112',
    EventMentor: '',
    MafiaMentor: '',
    BunkerMentor: '',
    CloseMentor: '',
    CreativeMentor: '',
    ContentMentor: '',

    Dota: "867411578838843433",
    Cs: "867411587996057610",
    Valorant: "867411593351397376",
    Minecraft: "867411616822591528",
    Lol: "1141778163576340500",
    acquaintance: '1143698939397292082',

    AnNabor: "866391559510163467",
    AnKino: "939304687486779412",
    AnCreative: "957323257193844806",
    AnBrowser: "866317682286526473",
    AnNastolki: "931941549263167588",
    AnClose: "931940698490556446",
    AnMafia: "867412722864750602",
    AnBunker: "956585834302287952"
}

const Emoji = {
    PanelRules: "<:META_rules:1105566996751466618>",
    PanelCMD: "<:META_utility:1105566989981847553>",
    PanelUtility: "<:META_cmd:1105566988748718230>",

    NaborControl: "<:control:1140293465478004837>",
    NaborAssist: "<:assist:1139696339337363456>",
    NaborEvent: "<:eventsmod:1139696149935173702>",
    NaborMafia: "<:ved:1139696198031249498>",
    NaborClose: "<:closer:1140293461745074176>",
    NaborCreative: "<:creative:1139696286149390376>",
    NaborContent: "<:kontent:1139696547437744211>",

    NaborAccept: "<:yes:1103377514597982258>",
    NaborDeny: "<:no:1103377512903475321>",
    Trash: "<:trashMeta:1110528689235574938>",

    Minecraft: "<:minectaftMeta:1110513498397622293>",
    Dota: "<:dotaMeta:1110512152797786183>",
    Valorant: "<:valorantMeta1:1110512148699938897>",
    CSGO: "<:CSGOMETA1:1110517992829239296>",
    LOL: "<:LoLMeta:1110512151388504144>",

    Ruchki: "<:handshakingMeta:1110504044495130666>",
    Cloudy: "<:oblachko:1140293645707247727>",
    Erydit: "<:brainEvent:1140293649159180328>",
    VHSClose: "<:vhsClose:1140293630012174356>",
    VHSMafia: "<:vhsVed:1140305459895615578>",
    Dubber: "<:meta_:1140294379341357148>",
    Music: "<:music:1140293634126790808>",
    Painter: "<:meta_:1140294383472746617>",
    Reader: "<:m5eta_:1140294387293765642>",
    Loveroom: "<:meta_:1140294363528839241>",
    Nitro: "<:booster:1140293639877173349>",
    Pictures: "<:picture:1141779766467383438>",
    Signa: "<:selfi:1140293650966921446>",
    Kubok: "<:kubok_:1140293658042704040>",

    NaborStuff: "<:naborstaff:965495296039731231>",
    Kino: "<:kono:1140293643551379657>",
    CreativeAn: "<:creaanons:965495296262025276>",
    Dice: "<:dice:965495296366903296>",
    Browser: "<:hlopushka:965495295922298882>",
    CloseAn: "<:closeanons:965495296245268511>",
    BunkerAn: "<:bunkermeta:965530345363636225>",
    MafiaAn: "<:mafiameta:965530371120836608>",
}
const info =
{
    MainRules: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398196548947998/event_rules.png?width=1440&height=428"
            }
        }
    ],
    MainHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398196083376170/event_utility.png?width=1440&height=428"
            }
        }
    ],


    PanelCreative: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129401951638007818/reative_main.png?width=1440&height=428"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>**META | ИНФОРМАЦИЯ ТВОРЧЕСТВА**",
            "description": "<:meta_fon:1103228292154282045>\n**Ага!** Ты в самом **уютном** уголке сервера, где творятся чудеса.\nКликни на **кнопку** ниже, чтобы ознакомиться с **информацией**! \n\n\n> <:META_rules:1105566996751466618> — __**Правила**__\n> <:META_utility:1105566989981847553> — __**Полезности**__",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }

    ],
    PanelEvent: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398196909645924/event.png?width=1440&height=428"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>**META | ИНФОРМАЦИЯ**",
            "description": "<:meta_fon:1103228292154282045>\n**Привет!** Ты попал к всей **ивент-деятельности** сервера.\nКликни на **кнопку** ниже, чтобы ознакомиться с **информацией!**\n\n\n> <:META_rules:1105566996751466618> — __**Правила**__\n> <:META_utility:1105566989981847553> — __**Полезности**__",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    PanelClan: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129389462753910794/clans.png"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>**META | ИНФОРМАЦИЯ**",
            "description": "<:meta_fon:1103228292154282045>\n**Йо!** В этом чатике находится **всё,** что касается **кланов.** \nКликни на **кнопку** ниже, чтобы ознакомиться с **информацией**! \n\n\n> <:META_rules:1105566996751466618> — __**Правила**__\n> <:META_cmd:1105566988748718230> — __**Команды**__\n> <:META_utility:1105566989981847553> — __**Полезности**__",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],


    CreativeRules: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129401950761406586/reative_rules.png?width=1440&height=428"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>Правила творчества",
            "description": "<:meta_point1:1104006321931563060> Данная категория модерируется по всем правилам сервера.\n\n<:meta_point1:1104006321931563060> Запрещены любые виды спойлеров.\n\n<:meta_point1:1104006321931563060> Запрещено намеренное прерывание мероприятия.\n\n<:meta_point1:1104006321931563060> Запрещено несоблюдение тематики войса.\n\n<:meta_point1:1104006321931563060> Запрещена жесткая и необоснованная критика.\n\n<:meta_point1:1104006321931563060> Запрещено транслировать или обсуждать что-либо\n<:meta_fon:1103228292154282045> не относящееся к категории.\n\n<:meta_point1:1104006321931563060> Не рекомендуется использование плохо настроенного \n<:meta_fon:1103228292154282045> микрофона.\n\n<:meta_point1:1104006321931563060> Креатив имеет право не размучивать людей без творческой\n<:meta_fon:1103228292154282045> роли.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>Тематика чатов и войсов творчества",
            "description": "<#957358974557106246> - чат, в котором будут все афиши наших мероприятий.\n<#1080552093275918356> - форум, в котором выкладываются работы творческого характера.\n<#1025710195889934426> | <#957500335415492658> - канал, где вы можете проявлять\n свои музыкальные навыки.\n<#957596098267066388> | <#1060237030463909898> - канал, где вы можете проявлять\n свои навыки в озвучки.\n<#972150826619523112> - канал, где вы можете проявлять\n свои навыки чтения.\n<#1008348542957523005> - канал, где вы можете вместе смотреть фильмы и т.д.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    CreativeHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129401951289884722/reative_utility.png?width=1440&height=428"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Жалобы на Креативов**",
            "description": "__В каком случае, жалобу на Креатива одобрят:__\n\n<:tochka2:1105592211497832478> Креатив не соблюдает правил сервера/категории.\n<:tochka2:1105592211497832478> Есть видео, чтобы доказать свою сторону.\n<:tochka2:1105592211497832478> Жалоба написана адекватно и понятно.\n\nПо всем вопросам обращайтесь к <@698591173098471494>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Информация по ролям:**",
            "color": 2829617,
            "fields": [
                {
                    "name": "ㅤ",
                    "value": "<:fon:1105454056748626012>Роли, которые вы можете получить сразу в <#866071338334027776>.\n<@&957323257193844806> - все анонсы творческой афиши.\n<@&939304687486779412> -  для получения уведомлений об просмотре."
                },
                {
                    "name": "ㅤ",
                    "value": "<:fon:1105454056748626012>Роли, которые вы можете получить подав заявку в <#866071338334027776>.\n<@&960961223078338610> - выдается за навыки озвучки аниме, манги и тд.\n<@&866384097056391190> - выдается за музыкальные навыки.\n<@&972151574908502086> - выдается за навыки чтения поэзии, прозы, комиксов и тд."
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],


    EventHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398197236813925/event_eventer.png?width=1440&height=428"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Жалобы на Ивентеров**",
            "description": "__В каком случае, жалобу на Ивентера одобрят:__\n\n<:tochka2:1105592211497832478> Ивентер не соблюдает правил сервера/ивента.\n<:tochka2:1105592211497832478> Есть видео, чтобы доказать свою сторону.\n<:tochka2:1105592211497832478> Жалоба написана адекватно и понятно.\n\nПо всем вопросам обращайтесь к <@369403582086119424> и <@295493530548174848>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Роль Эрудита**",
            "description": "<:fon:1105454056748626012><@&944556971716149298> — ты уже знаешь, что эта роль говорит о твоих разносторонних знаниях в различных областях. \n\n<:fon:1105454056748626012> **Немного о самой роли:**\n\n<:tochka2:1105592211497832478> __**Получение:**__\n<:fon:1105454056748626012> Выдаётся эта роль за хорошую игру в \n<:fon:1105454056748626012> **Codenames** и **Alias**, а так же **SiGame.**\n*Можно получить по кнопке в чате <#1104722974491283536>!*\n\n<:tochka2:1105592211497832478> __**Возможности:**__\n<:fon:1105454056748626012> Благодаря этой роли ты получишь доступ в **закрытый** \n<:fon:1105454056748626012> голосовой и текстовый канал Эрудитов! \n\n<:tochka2:1105592211497832478> __**Ивенты для Эрудитов:**__\n<:fon:1105454056748626012> Такие ивенты помечаются смайликом \"🧠\". \n<:fon:1105454056748626012> Доступ **обычным** юзерам туда **закрыт.**\n\n<:tochka2:1105592211497832478> __**Исчезновение:**__\n<:fon:1105454056748626012> Забирается ролька за длительное отсутствие на ивентах.\n\n*Дополнительную информацию ты можешь узнать у <@369403582086119424>*",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    MafiaHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398195278073968/event_ved.png?width=1440&height=428"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Жалобы на Ведущих**",
            "description": "__В каком случае, жалобу на Ведущего одобрят:__\n\n<:tochka2:1105592211497832478> Ведущий не соблюдает правил сервера/ивента.\n<:tochka2:1105592211497832478> Есть видео, чтобы доказать свою сторону.\n<:tochka2:1105592211497832478> Жалоба написана адекватно и понятно.\n\nПо всем вопросам обращайтесь к <@699324257636712489> и <@424759973252169728>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "description": "<:fon:1105454056748626012><@&12312312313> — выжившие игроки в мафию или бункер. С ними\n не заскучаешь на ивенте.\n\n<:fon:1105454056748626012>**Немного о самой роли:**\n\n<:tochka2:1105592211497832478> __**Получение:**__\n<:fon:1105454056748626012> За частую и хорошую игру в **мафию** или **бункер.**\n<:fon:1105454056748626012> Заявки рассматривают **кураторы.**\n*Можно получить по кнопке в чате <#1104722974491283536>!*\n\n<:tochka2:1105592211497832478> __**Возможности:**__\n<:fon:1105454056748626012> Благодаря этой роли ты получишь доступ в **закрытый** \n<:fon:1105454056748626012> голосовой и текстовый канал **Выживших** игроков! \n\n<:tochka2:1105592211497832478> __**Снятие:**__\n<:fon:1105454056748626012> Забирается ролька за длительное отсутствие\n<:fon:1105454056748626012> на **мафии** или **бункере**.\n\n*Дополнительную информацию ты можешь узнать у <@699324257636712489>*",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    CloseHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398195676520601/event_closer.png?width=1440&height=428"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Жалобы на Клозеров**",
            "description": "__В каком случае, жалобу на Клозера одобрят:__\n\n<:tochka2:1105592211497832478> Клозер не соблюдает правил сервера/клоза.\n<:tochka2:1105592211497832478> Есть видео, чтобы доказать свою правоту.\n<:tochka2:1105592211497832478> Жалоба написана адекватно и понятно.\n\nПо всем вопросам обращайтесь к <@403574551705026560> и <@899964230588067850>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "title": "<:fon:1105454056748626012>Роль крутого игрока",
            "description": "<:fon:1105454056748626012><@&1013381038111739914> — да, это те самые **потные** игроки в такие игры как:\n<:fon:1105454056748626012> *Dota 2, League of Legends, Valorant, CS:GO*.\n\n<:fon:1089964954834174083> **Немного о самой роли:**\n\n<:tochka2:1105592211497832478> __**Получение:**__\n<:fon:1105454056748626012> За частую игру в **клозы.** Заявки рассматривают **кураторы.**\n*Можно получить по кнопке в чате <#1104722974491283536>!*\n\n<:tochka2:1105592211497832478> __**Снятие:**__\nПотерять статус крутого игрока ты можешь по этим причинам:\n<:fon:1105454056748626012> Не участвуешь в клозах.\n<:fon:1105454056748626012> Не соответствуешь уровню игры.\n<:fon:1105454056748626012> Неадекватное поведение на клозах.\n\n<:tochka2:1105592211497832478> __**Возможности:**__\n<:fon:1105454056748626012> Дополнительные румы.\n<:fon:1105454056748626012> Доступ в переполненные комнаты клозов.\n\n*Дополнительную информацию ты можешь узнать у <@403574551705026560>.*",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],


    EventRules: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398197236813925/event_eventer.png?width=1440&height=428"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>Список ивентов | META",
            "description": "**Привет!** Все ивенты __**кликабельны**__. Ссылка ведёт на **Google**\n документ с **правилами** и описанием ивента.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "color": 2829617,
            "fields": [
                {
                    "name": "ㅤ",
                    "value": "[7 чудес: Архитекторы](https://docs.google.com/document/d/1G_j55M5CfLrAu382bnFPyGwEuYDpqyNNlC0gFP0tWiM/edit?usp=sharing)\n[Битва на пастбище](https://docs.google.com/document/d/1JTXTVLXvbKHgMvUWyGAFRiXOYQQuImxJLAk6Krl6zdk/edit?usp=sharing)\n[Без остановки](https://docs.google.com/document/d/1MWrYj3F6A-qdD7fSvogki3ZQOVgO62l9pa4nFXnlWkY/edit?usp=sharing)\n[Бабочки](https://docs.google.com/document/d/13fvGE4rUWl6kjKj6jhH6Li19uGTu4S-1D7vSuFMZcVM/edit?usp=sharing)\n[Гномы-вредители](https://docs.google.com/document/d/1TL3Ex4dwN3jprJs4ZCo-SwZPEsrN-1mCxysh4GTivEA/edit?usp=sharing)\n[Каменный век](https://docs.google.com/document/d/15AExulcC-s4XaFtV5Fh3ue1agzVPTy9n4r2d5bfAmJs/edit?usp=sharing)\n[Каркассон](https://docs.google.com/document/d/1YvKOiIdGYDnXtGSG8qPk-SVglFWg57lUzusllzzXTxQ/edit?usp=sharing)",
                    "inline": true
                },
                {
                    "name": "ㅤ",
                    "value": "[Колоретто](https://docs.google.com/document/d/1FJtBhRfS1xh3MepQzhLqwGmqyX9r2HAk1dXNeUTvf8Y/edit?usp=sharing)\n[Корова](https://docs.google.com/document/d/1BXyYjllxVSZrQv9PFo6PMxCe_eAYA_E5OmnZq7wyNM4/edit?usp=sharing)\n[Кубички](https://docs.google.com/document/d/1Z22C0jUNwpT9W_pXNfUEKO4-3Es9MzO3sfOcSUpYN2g/edit?usp=sharing)\n[Сыщики](https://docs.google.com/document/d/1HbbhSRoqDlIgTKmic7J3hEh9dcVXjNDO27WlUlxCOCs/edit?usp=sharing)\n[Соло](https://docs.google.com/document/d/1FV4rSz_5WSBzEX75hqgIxNxZaiLNuZ-BsUY-HDGDQTg/edit?usp=sharing)\n[Своя игра](https://docs.google.com/document/d/1L8QNhKsnlRn9ZzJBKqGMR7q6HvJ0SnGQYoR97E-Nfoc/edit?usp=sharing)\n[Суши карты](https://docs.google.com/document/d/1OL50cRIhXJyREheCwCV5iVv9DODjgzDDXmq9akWaSww/edit?usp=sharing)",
                    "inline": true
                },
                {
                    "name": "ㅤ",
                    "value": "[Слова из слов](https://docs.google.com/document/d/1QinyGfcr4Cq3t6-G2qyAVbHdrq1vWlaAdJM0s_enhlg/edit?usp=sharing)\n[Секретный Гитлер](https://docs.google.com/document/d/1YjdnTL0FFyTdJ1ae9V_K4Ej6rW77D44FSMbGDFF8pkc/edit?usp=sharing)\n[Смотрим вместе](https://docs.google.com/document/d/1i1aIINg_Ty22fOJzWI9UTQm08F7cqgPTX6IUc4CL3jQ/edit?usp=sharing)\n[Кто я](https://docs.google.com/document/d/1xwOYbCdYQHBcJV_e6-kCdAhytyAwFsrIcWUTuA5DexQ/edit?usp=sharing)\n[Монополия](https://docs.google.com/document/d/13HxOIP4sCqmEqgIfvrhUtXspc5alahy-H-b8-vCCHIU/edit?usp=sharing)\n[Угадайка](https://docs.google.com/document/d/1b7ShBDnLNKNGrM6uYlkUAQzk3h63YZWJEGzmNFBwcLk/edit?usp=sharing)\n[Шляпа](https://docs.google.com/document/d/1Mtu8J8Lfv1k7fo_FHKPPx-F4BcCdxs0VHocKgNLj7SI/edit?usp=sharing)",
                    "inline": true
                },
                {
                    "name": "ㅤ",
                    "value": "[Сломанный телефон](https://docs.google.com/document/d/1Z57JqNT8roBG6cBTLmgrA5Lw_AlrvjaY0BDZhOdp0Cc/edit?usp=sharing)\n[Такеноко](https://docs.google.com/document/d/1lZUtg8dpiL7x1rcmngYgeAuQbAoVOHTxUg2W-Tkir-k/edit?usp=sharing)\n[Токайдо](https://docs.google.com/document/d/1Q1eIazvlZAeRQ2oVlNMkMu46a-gUMw0_VrtSNNVUzU8/edit?usp=sharing)\n[Ток](https://docs.google.com/document/d/1eHSNOhnVNYzHI3P00sLWeKaZWpQ4w0qxo4g0DY1OLTU/edit?usp=sharing)\n[Покер на костях](https://docs.google.com/document/d/1Sj0cqmjJnAnRUn8uwUwalMqd0GUa_d5GdGBqEiV5hsA/edit?usp=sharing)\n[Codenames](https://docs.google.com/document/d/19IdFJsL0IwFMYAiZhSF5HHin0-0rp1pgJJo5OsTphv4/edit?usp=sharing)\n[HaxBall](https://docs.google.com/document/d/18GhgSJRtSXVZJAxv4092wxz-AYta3yzYJyJmtUvfZ1w/edit?usp=sharing)\n[Цитадели](https://docs.google.com/document/d/1Tk_On-fJozn_4o-NZJRaJyMMCE1I0vm2kO2gQyCWjdI/edit?usp=sharing)",
                    "inline": true
                },
                {
                    "name": "ㅤ",
                    "value": "[Jackbox](https://docs.google.com/document/d/1yrkQVJpZ98IMrzjl9SGklt3LxsFmArCTXRYY3nMEsjw/edit?usp=sharing)\n[Данетки](https://docs.google.com/document/d/1Zlkn1U5M3Ya2qUO7lNggSG7vQV-36uwVaAh-FP-Emkw/edit?usp=sharing)\n[Декодер](https://docs.google.com/document/d/1xGaJe6S8Qk5STGhy-DY-kBqjC_PGBSTKeilzc6LPYbc/edit?usp=sharing)\n[Дурак](https://docs.google.com/document/d/12P7igjE2BABwNdS7phk-UnXS-QuW4DPMMy-PEhA0C1Y/edit?usp=sharing)\n[Загадки](https://docs.google.com/document/d/1q-ujPkF9_pDGT4oWH9f3_KPdGujsn_os4pVHKHR6i6E/edit?usp=sharing)\n[Имаджинариум](https://docs.google.com/document/d/1SdP58DaCV6y1ic72lCFf4WKOSnzalrRGofPn_S9Avgc/edit?usp=sharing)\n[Намек понял](https://docs.google.com/document/d/11E7aIRgD-itmz1WYOa_AJvbxj4wYZDQcBK3Z3X4pvb4/edit?usp=sharing)\n[Шпион](https://docs.google.com/document/d/1xdi-g-8jY73teNR2Nq5Fgo4xZXtMpBu1gxF4Aqrtd2k/edit?usp=sharing)",
                    "inline": true
                },
                {
                    "name": "ㅤ",
                    "value": "[Пазлы](https://docs.google.com/document/d/1uSBxAZniUkUiZgKg-MUB_CIcGmFtztQD3lhmbQLMxIM/edit?usp=sharing)\n[Покер](https://docs.google.com/document/d/1OYahmE_pt3T_55zrkjiYLPla4BA19uBkz-R-O5TNJpg/edit?usp=sharing)\n[Криминалист](https://docs.google.com/document/d/1PC-G0HzX7v0lBi5FKOuDMYDagE-AC6qH8Wg7XKNl6e8/edit?usp=sharing)\n[Крокодил](https://docs.google.com/document/d/1lh9EJLi-Gi4HKPt4PKdHmGKkHHC0bsAxivgqka7pLrk/edit?usp=sharing)",
                    "inline": true
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    MafiaRules: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398195278073968/event_ved.png?width=1440&height=428"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>Список ивентов | META",
            "description": "**Привет!** Все ивенты __**кликабельны**__. Ссылка ведёт на **Google**\n документ с **правилами** и описанием ивента.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "color": 2829617,
            "fields": [
                {
                    "name": "ㅤ",
                    "value": "[Мафия город](https://docs.google.com/document/d/1rJnVYjazxKjj0wbjgCB-AlghW_vvZfgXgDKorS-16ns/edit?usp=sharing)\n[Мафия классика](https://docs.google.com/document/d/1tCDQvhRt2bHBdhdtlVvtCEddg41sshc_KPtzGrnk8KY/edit?usp=sharing)",
                    "inline": true
                },
                {
                    "name": "ㅤ",
                    "value": "[Бункер](https://docs.google.com/document/d/1-urk6w7mGP-JehBUFeAsvf3DrzJ8k2QMJfwhZLusbKY/edit?usp=sharing)\n[Бункер-Апокалипсис](https://docs.google.com/document/d/1bBUY8bzJ5YfwGKK-At8c4-wuWVcuNLvOQ4aIZJKthLk/edit)\n[Бункер Онлайн](https://docs.google.com/document/d/1aHJ_pitSErlWUyV3n5hsTFRW65xu4WeYeJfN-rTwD4M/edit)",
                    "inline": true
                },
                {
                    "name": "ㅤ",
                    "value": "[Остров](https://docs.google.com/document/d/14l8lOB1QLqdcQ9mF5QeQ68I9PrLI_8KthYQ2O69RGEc/edit?usp=sharing)\n[Жестокие игры](https://docs.google.com/document/d/1iIb-ZwaPdgmtteDuDJDZpsB7u5AdZZzahKJ48Q4jBQk/edit)",
                    "inline": true
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    CloseRules: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398195676520601/event_closer.png?width=1440&height=428"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>Список ивентов | META",
            "description": "**Привет!** Все ивенты __**кликабельны**__. Ссылка ведёт на **Google**\n документ с **правилами** и описанием ивента.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "color": 2829617,
            "fields": [
                {
                    "name": "ㅤ",
                    "value": "[Dota close](https://docs.google.com/document/d/18knsfwAZZsnxfJASr6blCCLG97DcLL8pfXHM4f_dg1E/edit?usp=sharing)\n[CS:GO close](https://docs.google.com/document/d/1rBxKRdlCfnLw6WrtJ0bwuwtDT5JM7JEtYREkX2663Xg/edit?usp=sharing)",
                    "inline": true
                },
                {
                    "name": "ㅤ",
                    "value": "ㅤ",
                    "inline": true
                },
                {
                    "name": "ㅤ",
                    "value": "ㅤㅤㅤㅤㅤㅤㅤㅤ[Valorant close](https://docs.google.com/document/d/1vmihjoubk1yJLjQnp4Unr69TozxLGnRZyKAPsijILqw/edit?usp=sharing)\nㅤㅤㅤㅤㅤㅤㅤㅤ[Lol close](https://docs.google.com/document/d/1WpST_XtX1M90j8nnPW0fPYwG5as_ejoz-XEnLGnhqhI/edit?usp=sharing)",
                    "inline": true
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],


    ClanRules: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129389463114616872/clans_rules.png"
            }
        },
        {
            "title": "<:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012>**Правила кланов**",
            "description": "<:tochka1:1105578682631852146> Внутриклановые чаты модерируются по правилам \ntos, 2.4 и 3.7.\n\n<:tochka1:1105578682631852146> В разборе конфликтов между кланами участвуют не только ответственный за кланы, но и лидеры/зам. лидера кланов.\n\n<:tochka1:1105578682631852146> Запрещено использование багов системы в личных целях.\n\n<:tochka1:1105578682631852146> Запрещено ставить оскорбительные и/или приближенные к ролям стаффа и/или нарушающие правила сервера, дискорда названия кланов.\n\n<:tochka1:1105578682631852146> Лидер и заместитель клана может кикнуть участника по собственному желанию.\n\n<:tochka1:1105578682631852146> Запрещено находиться в двух разных или тех же кланах с основы и твинка, а также принятие в клан человека с баном.\n\n<:tochka1:1105578682631852146> В категории ``КЛАН НАБОРЫ`` запрещено заниматься чем либо, кроме самого набора в клан.\n\n<:tochka1:1105578682631852146> Запрещена навязчивая агитация и реклама \nвступления в клан.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    ClanCMD: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129389463785705573/clans_comands.png"
            }
        },
        {
            "title": "<:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012>**Команды кланового бота**",
            "description": "**(некоторые из команд доступны только после верификации)**\n\n<:fon:1105454056748626012>После создания клана в нем сразу присутствует: \n<:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012>``50 мест + 1 слот на зама``\n\n<:tochka1:1105578682631852146>**/clan edit**\n<:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012> — изменить цвет — ``2000 конфет``\n<:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012> — название — ``3000 конфет``\n<:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012> — докупить слоты — ``5 слотов - 1500 конфет``\n<:tochka1:1105578682631852146>**/clan deposit (кол-во юки)** — пополнить казну.\n<:tochka1:1105578682631852146>**/clan shop** — магазин.\n<:tochka1:1105578682631852146>**/clan buy badge** — приобрести новый бейдж.\n<:tochka1:1105578682631852146>**/clan buy profile** — приобрести новый профиль.\n<:tochka1:1105578682631852146>**/clan buy deputy** — приобрести слот заместителя(max 3) — \n<:fon:1105454056748626012><:fon:1105454056748626012>``1 слот - 2500 конфет``\n<:tochka1:1105578682631852146>**/clan buy voice** — приобрести дополнительный войс канал.\n<:tochka1:1105578682631852146>**/clan v_list** — информация о доступах в голосовые каналы.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    ClanHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129389463441789048/clans_utility.png"
            }
        },
        {
            "title": "<:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012><:fon:1105454056748626012>**Общая информация**",
            "description": "<:fon:1105454056748626012>**Поддержание клана:**\n<:tochka1:1105578682631852146>Клану необходимо набирать не менее **500** часов в месяц.\n\n<:fon:1105454056748626012>**Верификация:**\nВерификация — это процесс, после которого у клана появляется **полный доступ** к функционалу.\n<:tochka1:1105578682631852146>Необходимо **25000**<:konfeta:1105580295652130936> в казне клана, **500** часов онлайна и заполнить **заявку** по кнопке **ниже.**\n\n**Технические вопросы, найденные баги, предложения по боту, а также вопросы, идеи и предложения по Кланам: <@270664753129455626>\nЖалобы на Кланы: <@484810299984183297>**",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],

    acquaintance: [
        {
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/1129389401630314507/1171539603799421049/love.png?ex=655d0c47&is=654a9747&hm=f4176e210553a1e9e57597b7c2633e71505759b2078a4454d4b10ace46d90fac&"
            }
        },
        {
            "title": "**Соглашение перед использованием**",
            "description": "- **Общие правила чатов:**\n<:fon_meta:1105454056748626012><a:heartdotmeta00:965684404850679837>Уважайте себя и других пользователей.\n<:fon_meta:1105454056748626012><a:heartdotmeta01:965684412828237934>Чаты придерживаются всех правил сервера.\n<:fon_meta:1105454056748626012><a:heartdotmeta02:965684420696768512>Запрещено несоответствие тематики чатов.\n<:fon_meta:1105454056748626012><a:heartdotmeta03:965684428271665182>Запрещено писать анкеты большим шрифтом.\n<:fon_meta:1105454056748626012><a:heartdotmeta04:965684435741716510>Ответы пользователей должны происходить в ЛС.\n<:fon_meta:1105454056748626012><a:heartdotmeta05:965684442704269412> Запрещено использование чата людям меньше 18 лет!\n\n- **Примечание:**\n<:fon_meta:1105454056748626012><a:heartdotmeta06:965684449125761064>В чатах есть дополнительные правила, обязательно прочитайте их.\n```За нарушение правил, модерация сервера оставляет за собой право удалить ваше сообщение, и выдать вам наказание в соответствии с правилами сервера.```",
            "color": 2829617,
            "footer": {
                "text": "Чтобы получить доступ к поиску, вам нужно нажать на кнопку ниже!"
            },
            "image": {
                "url": "https://media.discordapp.net/attachments/1161663603628331149/1169901821322604574/1.png?ex=655716f9&is=6544a1f9&hm=d93aedd4330d9dd80d65aa7b69cd78cfe3de1dff8655a2feb9647997949f728c&=&width=1440&height=33"
            }
        }
    ]

}
const Nabor = {
    control: [
        {
            "title": "Открыт набор на роль Контрол!",
            "description": "Надоели нарушители в голосовых каналах? Тогда мы рады сообщить что у тебя есть возможность стать <@&842077390641561610> и следить за порядком в голосовых каналах!!\n\n<a:META_Lapka:1105433363919163432>  **Что от вас требуется?**\n<:META_1:1139528267351732225> Адекватность и стрессоустойчивость;\n<:META_2:1139528265850167408> Возраст от 16-ти лет;\n<:META_3:1139528263031599155> Знание <#865770301110353970> ;\n<:META_4:1139528260930256916> Свободное время на сервер от 3-х часов в день.\n\n<a:META_Lapka:1105433363919163432>  **Что мы предлагаем взамен?**\n<a:Arrow:1105437399460360202> **Discord Nitro**!\n<a:Arrow:1105437399460360202> Личная роль!\n<a:Arrow:1105437399460360202> Зарплата конфетами, которая зависит от вас!\n\n<a:pizda:985192153162592286> **Заинтересовали - пиши заявочку!** <a:pizda:985192153162592286>",
            "color": 3026739,
            "footer": {
                "text": "Если вы нам подходите, мы с вами свяжемся."
            },
            "image": {
                "url": "https://media.discordapp.net/attachments/943065220824309820/1171553311447593091/48efe8f16e7f0a4f.png?ex=655d190b&is=654aa40b&hm=5225666b975de6fba91961250239c82ce9ad79d98f571cee837d43e334ef8e26&=&width=1440&height=512"
            }
        }
    ],
    assist: [
        {
            "title": "Набор в Ассистенты.",
            "description": "Общаешься в чате сервера, но тебе мешают нарушители? Тогда у тебя есть прекрасная возможность наказать их, ведь сейчас открыт набор на <@&1139669836696387745>.\n\n<:contenters:1171553774184169483> **Что от тебя требуется?**\n\n<:tochka2:1105592211497832478> Знание правил сервера и их понимание. \n<:tochka2:1105592211497832478> Адекватность и стрессоустойчивость.\n<:tochka2:1105592211497832478> Желание работать и делать наш сервер лучше.\n<:tochka2:1105592211497832478> Свободное время.\n\n<:contenters:1171553774184169483> **Что ты получишь взамен?**\n\n<:tochka2:1105592211497832478>  Приятный и коммуникабельный коллектив.  \n<:tochka2:1105592211497832478>  Зарплату в виде серверной валюты.\n<:tochka2:1105592211497832478>  Возможность карьерного роста.  \n<:tochka2:1105592211497832478>  Награды за индивидуальные заслуги.\n\n<:contenters:1171553774184169483> **Ты заинтересовался в должности?**\n\nТогда подавай заявку и вступай в наши ряды.",
            "color": 14974436,
            "footer": {
                "text": "Если у тебя нет опыта, это не проблема, наши кураторы тебя всему научат.",
                "icon_url": "https://i.pinimg.com/564x/94/25/d7/9425d76c9a29d13c188f34fbb66ec450.jpg"
            },
            "image": {
                "url": "https://media.discordapp.net/attachments/1094229463186800711/1171555679023136838/c9ee85423526db00.png?ex=655d1b40&is=654aa640&hm=be526bf4ad42ce7af0983cc6792639cdfe77c0af08b4f6304d4e02c8e62f2e78&="
            }
        }
    ],
    event: [
        {
            "title": "<:lisichkametaevent:1140667994989674656> Опа! Набор на ветку **Ивентеров**!\n<:fon:1089964954834174083>",
            "description": "<:tochkaten:975081467573043240>    На роли <@&865974246597066762> ты сможешь попробовать себя в проведении **различных ивентов**. Именно мы создаём **уютную** атмосферу на сервере!\n<:fon:1089964954834174083>",
            "color": 10057848,
            "fields": [
                {
                    "name": "<:lisichkametaevent:1140667994989674656> **Что же мы ждём от тебя?**",
                    "value": "<:tochkaten:975081467573043240>    Готовность хостить 200 минут в неделю\n<:tochkaten:975081467573043240>    Знание ивентов, которые вы будете проводить\n<:tochkaten:975081467573043240>   Адекватность и стрессоустойчивость\n<:tochkaten:975081467573043240>   Быть готовым к работе в коллективе\n<:fon:1089964954834174083>"
                },
                {
                    "name": "<:lisichkametaevent:1140667994989674656> Что мы готовы предложить:",
                    "value": "<:tochkaten:975081467573043240>    Френдли атмосферу на ветке\n<:tochkaten:975081467573043240>    Приятные бонусы в виде наград за неделю и месяц\n<:tochkaten:975081467573043240>  Помощь в изучении новых ивентов и в развитии\n<:tochkaten:975081467573043240>   Игры и взаимодействия между ивентерами\n<:fon:1089964954834174083>",
                    "inline": true
                },
                {
                    "name": "<:lisichkametaevent:1140667994989674656> **Мы тебя заинтересовали?**",
                    "value": "<:tochkaten:975081467573043240>   Тогда очень ждем тебя на нашей ветке!"
                }
            ],
            "image": {
                "url": "https://media.discordapp.net/attachments/1026820169340813363/1171550767044366407/14be06d26182c883.png?ex=658200ad&is=656f8bad&hm=dedd9b7c2507bb7fecd376221848362a5aea6df5e311e04d84fc6d969503d81e&=&format=webp&quality=lossless"
            }
        }
    ],
    mafia: [
        {
            "title": "<:musvecher_star:1128722704820875264> Идет набор на роль Ведущего!",
            "description": "<:musvecher_polos:1128721846116819134> Тебе нравятся **настольные игры** и ты хотел(а) бы попробовать **проводить** их? Тогда приглашаем тебя на должность <@&944556479405522984>.\n\n<:musvecher_polos:1128721846116819134> **От тебя потребуется:**\n<:musvecher_arrow:1128720303925755956> Знание [правил](https://discord.com/channels/822354240713261068/865770301110353970/1163399987825225779) сервера.\n<:musvecher_arrow:1128720303925755956> Адекватность и коммуникабельность.\n<:musvecher_arrow:1128720303925755956> Знание правил Бункера или Мафии.\n<:musvecher_arrow:1128720303925755956> Качественный вывод звука.\n\n<:musvecher_polos:1128721846116819134> **Что тебя ждет:**\n<:musvecher_arrow:1128720303925755956> Зарплата в виде конфет и других плюшек.\n<:musvecher_arrow:1128720303925755956> Карьерный рост, ламповое комьюнити и опыт.\n<:musvecher_arrow:1128720303925755956> Принятие участия в жизни и развитии нашего проекта.\n\n<:musvecher_polos:1128721846116819134> **Заинтересовала данная должность?**\n<:musvecher_arrow:1128720303925755956> В таком случае **жми** на [кнопки](https://discord.com/channels/822354240713261068/993248594222121010/1140954193964834927)",
            "color": 16749536,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/1166632944752934942/1171558695495278635/7b30d3d7caa1f91b.png?ex=655d1e0f&is=654aa90f&hm=803236846a7e14af1399a8b3943dda2c12532d8da9cca8100d111b303813c683&"
            }
        }
    ],
    close: [
        {
            "title": "<:angel01:1105437395828084767>  **Набор на должность клозера**!",
            "description": "Если ты заинтересован в __*клозах*__ и __*пабах*__ по различным играм, то тебе к :<@&866366388117176320>\n\n<a:META_Cvetok:1105433360760844288> **Что нам требуется от тебя?**\n\n<:tochka:1105437401356193814> Желание проводить клозы/пабы\n<:tochka:1105437401356193814> Коммуникабельность \n<:tochka:1105437401356193814> Наличие свободного времени\n\n<a:META_Cvetok:1105433360760844288> **Что мы дадим взамен?**\n\n<a:Arrow:1105437399460360202> Приятный коллектив и дружеская атмосфера\n<a:Arrow:1105437399460360202> Новые знакомства и опыт\n<a:Arrow:1105437399460360202> Различные плюшки в виде: *квестов*, *конфет*, *роли* и конечно же ***Nitro***!\n\n<a:oblachki:1105435699034992701> **Мы заинтересовали тебя?**\nТогда будем ждать твоей заявки! <a:luv:1105437397124132924>",
            "color": 15778789,
            "footer": {
                "text": "Если нам понравится твоя заявка, мы уведомим тебя об этом!"
            },
            "image": {
                "url": "https://media.discordapp.net/attachments/1026820169340813363/1171550767354761238/403d153c4549718b.png?ex=658200ad&is=656f8bad&hm=b267809e0a0e30796383553c8b33857566b4fd9a06049fa0d36b05eeca064fa9&=&format=webp&quality=lossless"
            }
        }
    ],
    creative: [
        {
            "title": "<:fon:1105454056748626012> <:fon:1105454056748626012> <:fon:1105454056748626012> <:fon:1105454056748626012> <a:dub_bant:1139580093577043969> Набор на Креатива! <a:dub_bant:1139580093577043969>",
            "description": "<a:META_Cvetok:1105433360760844288> **Креативы** - это творческие помощники сервера. Наша ветка ищет людей на направления:\n\n<:musvecher_arrow:1128720303925755956> **Музыкальное  -**   ответственные за <#1025710195889934426> и <#957500335415492658>, выдачу роли музыканта и проведение музыкальных мероприятий.\n<:musvecher_arrow:1128720303925755956> **Озвучка -**  ответственные за <#957596098267066388> , выдачу роли даббера и проведение озвучек.\n<:musvecher_arrow:1128720303925755956>  **Литературное -**  ответственные за <#972150826619523112>, выдачу роли чтеца и проведение литературных мероприятий.\n\n<a:META_Cvetok:1105433360760844288> **Что от вас требуется:** \n\n<:tochka2:1105592211497832478> Адекватность и стрессоустойчивость;\n<:tochka2:1105592211497832478> Знание и соблюдение правил нашего проекта;\n<:tochka2:1105592211497832478> Готовность работать в коллективе и помогать друг другу;\n<:tochka2:1105592211497832478> Желательны творческие успехи.\n\n<a:META_Cvetok:1105433360760844288> **Что мы предлагаем взамен:**\n\n<:tochka2:1105592211497832478> Вы сможете принять участие в развитии проекта;\n<:tochka2:1105592211497832478> Классное времяпровождение с дружным коллективом;\n<:tochka2:1105592211497832478> Дополнительная поддержка вашего творчества;\n<:tochka2:1105592211497832478> Зарплата в виде <:konfeta:1105580295652130936> и других плюшек: Discord Nitro, личная комната, роли и многое другое.",
            "color": 16749536,
            "image": {
                "url": "https://media.discordapp.net/attachments/1133899728594153484/1171553827284074607/a6c0bd9f950c8c67.png?ex=655d1986&is=654aa486&hm=39acab40b23da3442081f364e672aa9606f98df98316dbdc8e0fda5813277d7f&"
            }
        }
    ],
    contenter: [
        {
            "title": "<:yejehebwkhebw:1171554129148121249> **Набор на контентера!**",
            "description": "<:tochka2:1105592211497832478> **Ты часто сидишь а соц сетях? А именно** ***Тик Ток*** **или** ***Ютуб*** **? Тогда с нетерпением будем ждать твою заявку на прекрасную роль: <@&1033705687047471124>!**\n\n<:ejejehhehe:1171553774184169483> **Что же нам нужно от тебя:**\n<:sjeihwhwhw:1171553941809533070> Адекватность \n<:sjeihwhwhw:1171553941809533070> Возраст 15+\n<:sjeihwhwhw:1171553941809533070> Желание и возможность работать \n\n<:ejejehhehe:1171553774184169483> **Что тебя ожидает взамен:**\n<:sjeihwhwhw:1171553941809533070> Зарплата в виде серверной валюты и разные плюшки \n<:sjeihwhwhw:1171553941809533070> Хорошее времяпровождение в дружном коллективе \n<:sjeihwhwhw:1171553941809533070> Возможный карьерный рост \n\n<:tochka2:1105592211497832478> **Тебя заинтересовало такое предложение? Тогда ждём тебя с нетерпением именно тебя!**",
            "color": 15103965,
            "image": {
                "url": "https://media.discordapp.net/attachments/1068233938939682949/1171552555701125140/3abe17074fd59b84.png?ex=656652d7&is=6553ddd7&hm=c5ce6afb314eb4faff4e5b27e74d48acd9ef4a6854df939d9eac8cd8d707f192&"
            }
        }
    ]
}
const roles = {
    Announcement: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1171538031531020309/52623a95ba8c936b.png?ex=655d0ad0&is=654a95d0&hm=9d55b70ef18ff3378364bafe4c0f7644d46d542e12992d32309b7607ab9daaf9&="
            }
        },
        {
            "title": "Роли для получения анонсов мероприятий:",
            "color": 2829617,
            "fields": [
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<:meta_:1140294353395400714> — Анонсы наборов в стафф\n<:kono_:1140293643551379657> — Анонсы кинотеатра\n<:creation:1140294359602970767> — Анонсы творчества\n<:event_2:1140294357002494024> — Анонсы браузерных игр",
                    "inline": true
                },
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<:event:1140294373284782180>— Анонсы настольных игр\n<:close:1140294375788777562> — Анонсы клозов\n<:mafia:1140294365705683044> — Анонсы мафии\n<:bunker:1140294369493135432> — Анонсы бункера",
                    "inline": true
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],

    Game: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1171538031971401788/roles.png?ex=655d0ad0&is=654a95d0&hm=32784668a6586678a91cbda33355300e74494f84d4f2b978f175752f3e4f8d71&="
            }
        },
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1171538032357285949/e82b1d59489098a9.png?ex=655d0ad1&is=654a95d1&hm=b45bf96a67cbbc2384e5c2feaca65c22bc385437b4fbf5b4f259103d909f74d5&="
            }
        },
        {
            "title": "Выбери роль, чтобы проще находить тиммейтов:",
            "color": 2829617,
            "fields": [
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<@&867411616822591528>\n<@&867411578838843433>\n<@&1141778163576340500>",
                    "inline": true
                },
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<@&867411587996057610>\n<@&867411593351397376>",
                    "inline": true
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],

    Custom: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1171538032877371402/8c24cbcd21922b7f.png?ex=655d0ad1&is=654a95d1&hm=9709a5f99ee3ba5905577f805224e345b315892efb9a69d9a85ddcfbf1f7266b&="
            }
        },
        {
            "title": "Информация о основных кастомных ролях сервачка:",
            "color": 2829617,
            "fields": [
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<:ruchki:1141100696926695524> — Товарищ сервера\n<:brainEvent:1140293649159180328> — Эрудированный юзер\n<:vhsClose:1140293630012174356> — Сильный игрок в клозах\n<:vinoBunker:1140305459895615578> — ХС в дискуссионных играх\n<:oblachko:1140293645707247727> — Порядочный человек\n<:microphone:1140294379341357148> — Даббер сервера \n<:music_:1140293634126790808> — Музыкант сервера",
                    "inline": true
                },
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<:palette:1140294383472746617> — Художник сервера\n<:book:1140294387293765642> — Чтец сервера\n<:love:1140294363528839241> — Лаврумы\n<:booster:1140293639877173349> — Нитро бустер\n<:picture:1141779766467383438> — Отправлять картинки\n<:selfi:1140293650966921446> — За сигну серверу\n<:kubok_:1140293658042704040> — За победу в глобалке",
                    "inline": true
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],




    AnRuchki: [
        {
            "description": "<:fon11:832188712644902927>**Информация о роли Товарищ Сервера —** <:handshakingMeta:1110504044495130666>\n\n<:fon11:832188712644902927>**Выдаётся:**\n<a:heartdotmeta00:965684404850679837>Бывшим Кураторам, Модераторам, Администраторам.\n<a:heartdotmeta01:965684412828237934>Людям, которые сделали много для сервера.\n\n<:fon11:832188712644902927>**Снятие:**\n<a:heartdotmeta02:965684420696768512>За грубые нарушения на сервере.\n\n<:fon11:832188712644902927>**Ответственный за выдачу:** <@297372127768870913>",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnCloud: [
        {
            "description": "<:fon:1105454056748626012>**Информация о роли облачка** — <:oblachko:965495296337522688>\n\n<a:dot01:965657669526491186><:oblachko:965495296337522688> — показатель адекватности пользователя, позволяет:\n<:fon11:832188712644902927><a:dot02:965657676719726602>Отправлять картинки и гифки в <#865961833427632138>.\n\n<a:dot03:965657685305483324>**Чтобы получить данную роль:**\n<:fon11:832188712644902927><a:dot04:965657699159261206>Нужно нажать на кнопочку ниже, и заполнить форму.\n\n<a:dot05:965657708164423770>**Обязательная форма заявки:**\n<:fon:1105454056748626012><a:dot07:965657721644937312>Ваше имя и возраст.\n<:fon:1105454056748626012><a:dot08:965657731061145741>Были ли у вас муты/варны/баны.\n<:fon:1105454056748626012><a:dot09:965657745925767228>Кол-во часов в голосовых каналах. (не менее 100 часов)\n<:fon:1105454056748626012><a:dot10:965657753844609115>Точная дата присоединения к серверу. (не менее 30 дней)\n\n<a:dot11:965657760211537921>При нарушении одного из правил, данная роль будет снята.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnErydit: [
        {
            "description": "<:fon11:832188712644902927>\n<@&944556971716149298> — роль мозга хихихахахах вот так вот.\n\n<:fon11:832188712644902927>**Получение:**\n<a:heartdotmeta00:965684404850679837>Выдаётся эта роль за хорошую игру в\n<a:heartdotmeta01:965684412828237934>Codenames и Alias, а так же SiGame.\n<a:heartdotmeta02:965684420696768512>Можно получить по кнопке ниже!\n\n<:fon11:832188712644902927>**Возможности:**\n<a:heartdotmeta00:965684404850679837>Благодаря этой роли ты получишь доступ в закрытый\n<a:heartdotmeta01:965684412828237934>голосовой и текстовый канал Эрудитов!\n\n<:fon11:832188712644902927>**Ивенты для Эрудитов:**\n <a:heartdotmeta00:965684404850679837>Такие ивенты помечаются смайликом \"\\🧠\".\n<a:heartdotmeta01:965684412828237934>Доступ обычным юзерам туда закрыт.\n\n<:fon11:832188712644902927>**Исчезновение:**\n <a:heartdotmeta00:965684404850679837>Забирается ролька за длительное отсутствие на ивентах.\n \n<:fon11:832188712644902927>**Доп инфа у товарища -** <@369403582086119424>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnCloseRole: [
        {
            "description": "<:fon11:832188712644902927><@&1013381038111739914> — да, это те самые потные игроки в такие игры как:\n<:fon11:832188712644902927>Dota 2, League of Legends, Valorant, CS:GO.\n\n<:fon11:832188712644902927>**Получение:** \n<a:heartdotmeta00:965684404850679837>За частую игру в клозы. Заявки рассматривают кураторы.\n<a:heartdotmeta01:965684412828237934>Можно получить по кнопке ниже!\n\n<:fon11:832188712644902927>**Потерять статус крутого игрока ты можешь по причинам:**\n<a:heartdotmeta02:965684420696768512>Не участвуешь в клозах.\n<a:heartdotmeta03:965684428271665182>Не соответствуешь уровню игры.\n<a:heartdotmeta04:965684435741716510>Неадекватное поведение на клозах.\n\n<:fon11:832188712644902927>**Возможности:**\n<a:heartdotmeta05:965684442704269412>Дополнительные румы.\n<a:heartdotmeta06:965684449125761064>Доступ в переполненные комнаты клозов.\n\n<:fon11:832188712644902927>**Ответственный за выдачу:** <@403574551705026560>",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnMafiaRole: [
        {
            "description": "<:fon11:832188712644902927><@&1107361619245285376> — выжившие игроки в мафию или бункер.\n\n<:fon11:832188712644902927>**Получение:** \n<a:heartdotmeta00:965684404850679837>За частую и хорошую игру в мафию или бункер.\n<a:heartdotmeta01:965684412828237934>Заявки рассматривают кураторы.\n\n<:fon11:832188712644902927>**Возможности:**\n<a:heartdotmeta02:965684420696768512>Благодаря этой роли ты получишь доступ в закрытый\n<a:heartdotmeta03:965684428271665182>голосовой и текстовый канал Выживших игроков!\n\n<:fon11:832188712644902927>**Снятие:**\n<a:heartdotmeta04:965684435741716510>Забирается ролька за длительное отсутствие\n<a:heartdotmeta05:965684442704269412>на мафии или бункере.\n\n<:fon11:832188712644902927>**Ответственный за выдачу:** <@699324257636712489>",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnDabber: [
        {
            "description": "<:fon:1105454056748626012> **Информация о роли** - <:mic:965495296341733376>\n\n<a:dot00:965657635691048970>**Роль даббера выдается за умения работать с голосом.**\n<:fon:1105454056748626012><a:dot01:965657669526491186>Даёт возможность говорить в <#957596098267066388>.\n\n<a:dot02:965657676719726602>**Критерии для получения роли:**\n<:fon:1105454056748626012><a:dot03:965657685305483324>Качественный вывод звука;\n<:fon:1105454056748626012><a:dot04:965657699159261206>Хорошее интернет соединение;\n<:fon:1105454056748626012><a:dot05:965657708164423770>Умение контролировать свой голос;\n<:fon:1105454056748626012><a:dot06:965657714787225610>[Согласие с правилами творческого уголка](https://discord.com/channels/822354240713261068/1050134401574502400/1052309872668053565);\n<:fon:1105454056748626012><a:dot07:965657721644937312>Адекватность, отсутствие глобальных нарушений.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnMusic: [
        {
            "description": "<:fon:1105454056748626012>**Информация о роли** - <:music:965495296316563536> \n\n<a:dot00:965657635691048970>**Роль музыканта выдается за музыкальные успехи.**\n<:fon:1105454056748626012><a:dot01:965657669526491186>Даёт возможность говорить в <#1025710195889934426>.\n\n<a:dot02:965657676719726602> **Критерии для получения роли:**\n<:fon:1105454056748626012><a:dot03:965657685305483324>Музыкальные навыки;\n<:fon:1105454056748626012><a:dot04:965657699159261206>Качественный вывод звука;\n<:fon:1105454056748626012><a:dot05:965657708164423770>[Согласие с правилами творческого уголка](https://discord.com/channels/822354240713261068/1025710195889934426/1135207285216510092);\n<:fon:916322554053029938><a:dot06:965657714787225610>Адекватность, отсутствие глобальных нарушений.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnPainter: [
        {
            "description": "<:fon:1105454056748626012> **Информация о роли** - <:artqq:965495296333348865>\n\n<a:dot00:965657635691048970>**Роль художника выдается за художественное мастерство.**\n<:fon:1105454056748626012><a:dot01:965657669526491186>Даёт возможность говорить в <#1025711356902641725>.\n\n<a:dot02:965657676719726602> **Критерии для получения роли:**\n<:fon:1105454056748626012><a:dot03:965657685305483324>Пример своей работы.\n<:fon:1105454056748626012><a:dot04:965657699159261206>Хорошее качество изображения;\n<:fon:1105454056748626012><a:dot05:965657708164423770>[Согласие с правилами публикаций форума](https://discord.com/channels/822354240713261068/1080556877731078154);\n<:fon:1105454056748626012><a:dot05:965657708164423770>Адекватность, отсутствие глобальных нарушений.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnReader: [
        {
            "description": "<:fon:1105454056748626012>**Информация о роли** - <:bookmeta:1026251022466822244>\n\n<a:dot00:965657635691048970>**Роль чтеца выдается за литературные познания.**\n<:fon:1105454056748626012><a:dot01:965657669526491186> Даёт возможность говорить в <#972150826619523112>.\n\n<a:dot02:965657676719726602> **Критерии для получения роли:**\n<:fon:1105454056748626012><a:dot03:965657685305483324> Качественный вывод звука;\n<:fon:1105454056748626012><a:dot04:965657699159261206>Умение контролировать свой голос;\n<:fon:1105454056748626012><a:dot05:965657708164423770>[Согласие с правилами творческого уголка](https://discord.com/channels/822354240713261068/1050132436417261629/1052311146973102140);\n<:fon:1105454056748626012><a:dot06:965657714787225610> Адекватность, отсутствие глобальных нарушений.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnLoveroom: [
        {
            "description": "<:fon11:832188712644902927>**Информация о любовных комнатах —** <:loveroom:965495296119410689>\n\n<:fon11:832188712644902927>**Для создания необходимо:**\n<a:heartdotmeta00:965684404850679837>Написать команду - `!marry <@user/id>` и наличие 1500 <:konfeta_00074:998600817902882826>.\n\n<:fon11:832188712644902927>**Общая информация:**\n<a:heartdotmeta01:965684412828237934>Каждый месяц с баланса пары взимается 1500 <:konfeta_00074:998600817902882826>;\n<a:heartdotmeta02:965684420696768512>Парный онлайн зачисляется, если пара сидит вместе.\n\n<:fon11:832188712644902927>**Подробная информация:**\n<a:heartdotmeta03:965684428271665182>Все команды связанные с любовным комнатами - [тут](https://discord.com/channels/822354240713261068/865919522870919209/1036395278997139476).",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnNitro: [
        {
            "description": "<a:dot01:965657669526491186>На нашем сервере существует роль — <:nitro2:965539708643991593>\n<:fon:1105454056748626012><a:dot02:965657676719726602>Чтобы получить роль, необходимо [бустануть](https://support.discordapp.com/hc/ru/articles/360028038352) наш сервер.\n\n<a:dot03:965657685305483324>Привилегии бустеров:\n<:fon:1105454056748626012><a:dot04:965657699159261206>Отправлять картинки и гифки в <#865961833427632138>\n\n<a:dot05:965657708164423770>Не забудь написать <@297372127768870913>, чтобы забрать 500 <:1_:834832753735893012>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnKartinki: [
        {
            "description": "<a:dot00:965657635691048970>Данная роль даёт возможность отправлять изображения \n<:fon_meta:1105454056748626012><a:dot01:965657669526491186><#865961833427632138>\n\n<a:dot02:965657676719726602>Для того чтобы получить данную роль, потребуется:\n<:fon_meta:1105454056748626012><a:dot03:965657685305483324>Написать команду </picture:1131516579356626945> и иметь в наличии 1000<:konfeta:1105580295652130936>",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnSigna: [
        {
            "description": "<:fon:1105454056748626012> Информация о **сигне <:selfak:965539198230749194>**\n\n <a:dot01:965657669526491186> **Но прежде чем сделать сигну, ознакомься с правилами:**\n<:fon:1105454056748626012> <a:dot02:965657676719726602> Фотография должна быть в хорошем качестве.\n<:fon:1105454056748626012> <a:dot03:965657685305483324> Фотография должна быть сделана вами.\n<:fon:1105454056748626012> <a:dot04:965657699159261206> Администрация имеет право отклонить публикацию.\n\n <a:dot05:965657708164423770> Повторно награда не выдается.\n<:fon:1105454056748626012> <a:dot06:965657714787225610> Ты получишь соответствующую роль — <:selfak:965539198230749194> и 300 <:konfeta:1105580295652130936>;\n\n<a:dot07:965657721644937312> Публиковать нужно в <#1080915514865504366> с одноименным тегом.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnKubok: [
        {
            "description": "<:fon11:832188712644902927>**Информация о роли Кубок —** <:kubok:965495296429801532>\n\n<:fon11:832188712644902927>**Чтобы получить роль необходимо:**\n<a:heartdotmeta00:965684404850679837>Победить в глобальном мероприятии.\n<a:heartdotmeta01:965684412828237934>Больше способов получить нет блина...\n\n<:fon11:832188712644902927>**Снятие:**\n<a:heartdotmeta02:965684420696768512>При победе другого участника в этом же мероприятие.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ]
}
module.exports = { Utility, Url, Emoji, info, Nabor, roles, RoleID, ChannelID }