const Utility = {
    colorDiscord: 2829617,
}
const Url = {
    ClanRules: "https://discord.com/channels/822354240713261068/1143999035095646218",
    ClanHelp: "https://discord.com/channels/822354240713261068/1143999117832491038",

    EventRules: "https://discord.com/channels/822354240713261068/1144618478553276476",
    EventHelp: "https://discord.com/channels/822354240713261068/1144618526590640229",

    CreativeRules: "https://discord.com/channels/822354240713261068/1143562380882751659",
    CreativeHelp: "https://discord.com/channels/822354240713261068/1143562420615401634",
}
const Emoji = {
    PanelRules: "<:META_rules:1105566996751466618>",
    PanelCMD: "<:META_utility:1105566989981847553>",
    PanelUtility: "<:META_cmd:1105566988748718230>",

    NaborControl: "<:control:1140293465478004837>",
    NaborAssist: "<:assist:1139696339337363456>",
    NaborEvent: "<:eventsmod:1139696149935173702>",
    NaborMafia: "<:ved:1139696198031249498>",
    NaborClose: "<:closer:1140293461745074176>",
    NaborCreative: "<:creative:1139696286149390376>",
    NaborContent: "<:kontent:1139696547437744211>",

    NaborAccept: "<:yes:1103377514597982258>",
    NaborDeny: "<:no:1103377512903475321>",
    Trash: "<:trashMeta:1110528689235574938>",

    Minecraft: "<:minectaftMeta:1110513498397622293>",
    Dota: "<:dotaMeta:1110512152797786183>",
    Valorant: "<:valorantMeta1:1110512148699938897>",
    CSGO: "<:CSGOMETA1:1110517992829239296>",
    LOL: "<:LoLMeta:1110512151388504144>",

    Ruchki: "<:handshakingMeta:1110504044495130666>",
    Cloudy: "<:oblachko:1140293645707247727>",
    Erydit: "<:brainEvent:1140293649159180328>",
    VHSClose: "<:vhsClose:1140293630012174356>",
    VHSMafia: "<:vhsVed:1140305459895615578>",
    Dubber: "<:meta_:1140294379341357148>",
    Music: "<:music:1140293634126790808>",
    Painter: "<:meta_:1140294383472746617>",
    Reader: "<:m5eta_:1140294387293765642>",
    Loveroom: "<:meta_:1140294363528839241>",
    Nitro: "<:booster:1140293639877173349>",
    Pictures: "<:picture:1141779766467383438>",
    Signa: "<:selfi:1140293650966921446>",
    Kubok: "<:kubok_:1140293658042704040>",

    NaborStuff: "<:naborstaff:965495296039731231>",
    Kino: "<:kono:1140293643551379657>",
    CreativeAn: "<:creaanons:965495296262025276>",
    Dice: "<:dice:965495296366903296>",
    Browser: "<:hlopushka:965495295922298882>",
    CloseAn: "<:closeanons:965495296245268511>",
    BunkerAn: "<:bunkermeta:965530345363636225>",
    MafiaAn: "<:mafiameta:965530371120836608>",
}
const info = {
    MainRules: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398196548947998/event_rules.png?width=1440&height=428"
            }
        }
    ],
    MainHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398196083376170/event_utility.png?width=1440&height=428"
            }
        }
    ],


    PanelCreative: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129401951638007818/reative_main.png?width=1440&height=428"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>**META | ИНФОРМАЦИЯ ТВОРЧЕСТВА**",
            "description": "<:meta_fon:1103228292154282045>\n**Ага!** Ты в самом **уютном** уголке сервера, где творятся чудеса.\nКликни на **кнопку** ниже, чтобы ознакомиться с **информацией**! \n\n\n> <:META_rules:1105566996751466618> — __**Правила**__\n> <:META_utility:1105566989981847553> — __**Полезности**__",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }

    ],
    PanelEvent: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398196909645924/event.png?width=1440&height=428"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>**META | ИНФОРМАЦИЯ**",
            "description": "<:meta_fon:1103228292154282045>\n**Привет!** Ты попал к всей **ивент-деятельности** сервера.\nКликни на **кнопку** ниже, чтобы ознакомиться с **информацией!**\n\n\n> <:META_rules:1105566996751466618> — __**Правила**__\n> <:META_utility:1105566989981847553> — __**Полезности**__",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    PanelClan: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129389462753910794/clans.png"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>**META | ИНФОРМАЦИЯ**",
            "description": "<:meta_fon:1103228292154282045>\n**Йо!** В этом чатике находится **всё,** что касается **кланов.** \nКликни на **кнопку** ниже, чтобы ознакомиться с **информацией**! \n\n\n> <:META_rules:1105566996751466618> — __**Правила**__\n> <:META_cmd:1105566988748718230> — __**Команды**__\n> <:META_utility:1105566989981847553> — __**Полезности**__",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],


    CreativeRules: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129401950761406586/reative_rules.png?width=1440&height=428"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>Правила творчества",
            "description": "<:meta_point1:1104006321931563060> Данная категория модерируется по всем правилам сервера.\n\n<:meta_point1:1104006321931563060> Запрещены любые виды спойлеров.\n\n<:meta_point1:1104006321931563060> Запрещено намеренное прерывание мероприятия.\n\n<:meta_point1:1104006321931563060> Запрещено несоблюдение тематики войса.\n\n<:meta_point1:1104006321931563060> Запрещена жесткая и необоснованная критика.\n\n<:meta_point1:1104006321931563060> Запрещено транслировать или обсуждать что-либо\n<:meta_fon:1103228292154282045> не относящееся к категории.\n\n<:meta_point1:1104006321931563060> Не рекомендуется использование плохо настроенного \n<:meta_fon:1103228292154282045> микрофона.\n\n<:meta_point1:1104006321931563060> Креатив имеет право не размучивать людей без творческой\n<:meta_fon:1103228292154282045> роли.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "title": "<:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045><:meta_fon:1103228292154282045>Тематика чатов и войсов творчества",
            "description": "<#957358974557106246> - чат, в котором будут все афиши наших мероприятий.\n<#1080552093275918356> - форум, в котором выкладываются работы творческого характера.\n<#1025710195889934426> | <#957500335415492658> - канал, где вы можете проявлять\n свои музыкальные навыки.\n<#957596098267066388> | <#1060237030463909898> - канал, где вы можете проявлять\n свои навыки в озвучки.\n<#972150826619523112> - канал, где вы можете проявлять\n свои навыки чтения.\n<#1008348542957523005> - канал, где вы можете вместе смотреть фильмы и т.д.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    CreativeHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129401951289884722/reative_utility.png?width=1440&height=428"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Жалобы на Креативов**",
            "description": "__В каком случае, жалобу на Креатива одобрят:__\n\n<:tochka2:1105592211497832478> Креатив не соблюдает правил сервера/категории.\n<:tochka2:1105592211497832478> Есть видео, чтобы доказать свою сторону.\n<:tochka2:1105592211497832478> Жалоба написана адекватно и понятно.\n\nПо всем вопросам обращайтесь к <@698591173098471494>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Информация по ролям:**",
            "color": 2829617,
            "fields": [
                {
                    "name": "ㅤ",
                    "value": "<:fon:1105454056748626012>Роли, которые вы можете получить сразу в <#866071338334027776>.\n<@&957323257193844806> - все анонсы творческой афиши.\n<@&939304687486779412> -  для получения уведомлений об просмотре."
                },
                {
                    "name": "ㅤ",
                    "value": "<:fon:1105454056748626012>Роли, которые вы можете получить подав заявку в <#866071338334027776>.\n<@&960961223078338610> - выдается за навыки озвучки аниме, манги и тд.\n<@&866384097056391190> - выдается за музыкальные навыки.\n<@&972151574908502086> - выдается за навыки чтения поэзии, прозы, комиксов и тд."
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],


    EventHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398197236813925/event_eventer.png?width=1440&height=428"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Жалобы на Ивентеров**",
            "description": "__В каком случае, жалобу на Ивентера одобрят:__\n\n<:tochka2:1105592211497832478> Ивентер не соблюдает правил сервера/ивента.\n<:tochka2:1105592211497832478> Есть видео, чтобы доказать свою сторону.\n<:tochka2:1105592211497832478> Жалоба написана адекватно и понятно.\n\nПо всем вопросам обращайтесь к <@369403582086119424> и <@295493530548174848>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Роль Эрудита**",
            "description": "<:fon:1105454056748626012><@&944556971716149298> — ты уже знаешь, что эта роль говорит о твоих разносторонних знаниях в различных областях. \n\n<:fon:1105454056748626012> **Немного о самой роли:**\n\n<:tochka2:1105592211497832478> __**Получение:**__\n<:fon:1105454056748626012> Выдаётся эта роль за хорошую игру в \n<:fon:1105454056748626012> **Codenames** и **Alias**, а так же **SiGame.**\n*Можно получить по кнопке в чате <#1104722974491283536>!*\n\n<:tochka2:1105592211497832478> __**Возможности:**__\n<:fon:1105454056748626012> Благодаря этой роли ты получишь доступ в **закрытый** \n<:fon:1105454056748626012> голосовой и текстовый канал Эрудитов! \n\n<:tochka2:1105592211497832478> __**Ивенты для Эрудитов:**__\n<:fon:1105454056748626012> Такие ивенты помечаются смайликом \"🧠\". \n<:fon:1105454056748626012> Доступ **обычным** юзерам туда **закрыт.**\n\n<:tochka2:1105592211497832478> __**Исчезновение:**__\n<:fon:1105454056748626012> Забирается ролька за длительное отсутствие на ивентах.\n\n*Дополнительную информацию ты можешь узнать у <@369403582086119424>*",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    MafiaHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398195278073968/event_ved.png?width=1440&height=428"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Жалобы на Ведущих**",
            "description": "__В каком случае, жалобу на Ведущего одобрят:__\n\n<:tochka2:1105592211497832478> Ведущий не соблюдает правил сервера/ивента.\n<:tochka2:1105592211497832478> Есть видео, чтобы доказать свою сторону.\n<:tochka2:1105592211497832478> Жалоба написана адекватно и понятно.\n\nПо всем вопросам обращайтесь к <@699324257636712489> и <@424759973252169728>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "description": "<:fon:1105454056748626012><@&12312312313> — выжившие игроки в мафию или бункер. С ними\n не заскучаешь на ивенте.\n\n<:fon:1105454056748626012>**Немного о самой роли:**\n\n<:tochka2:1105592211497832478> __**Получение:**__\n<:fon:1105454056748626012> За частую и хорошую игру в **мафию** или **бункер.**\n<:fon:1105454056748626012> Заявки рассматривают **кураторы.**\n*Можно получить по кнопке в чате <#1104722974491283536>!*\n\n<:tochka2:1105592211497832478> __**Возможности:**__\n<:fon:1105454056748626012> Благодаря этой роли ты получишь доступ в **закрытый** \n<:fon:1105454056748626012> голосовой и текстовый канал **Выживших** игроков! \n\n<:tochka2:1105592211497832478> __**Снятие:**__\n<:fon:1105454056748626012> Забирается ролька за длительное отсутствие\n<:fon:1105454056748626012> на **мафии** или **бункере**.\n\n*Дополнительную информацию ты можешь узнать у <@699324257636712489>*",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    CloseHelp: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1129398195676520601/event_closer.png?width=1440&height=428"
            }
        },
        {
            "title": "<:fon:1105454056748626012>**Жалобы на Клозеров**",
            "description": "__В каком случае, жалобу на Клозера одобрят:__\n\n<:tochka2:1105592211497832478> Клозер не соблюдает правил сервера/клоза.\n<:tochka2:1105592211497832478> Есть видео, чтобы доказать свою правоту.\n<:tochka2:1105592211497832478> Жалоба написана адекватно и понятно.\n\nПо всем вопросам обращайтесь к <@403574551705026560> и <@899964230588067850>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        },
        {
            "title": "<:fon:1105454056748626012>Роль крутого игрока",
            "description": "<:fon:1105454056748626012><@&1013381038111739914> — да, это те самые **потные** игроки в такие игры как:\n<:fon:1105454056748626012> *Dota 2, League of Legends, Valorant, CS:GO*.\n\n<:fon:1089964954834174083> **Немного о самой роли:**\n\n<:tochka2:1105592211497832478> __**Получение:**__\n<:fon:1105454056748626012> За частую игру в **клозы.** Заявки рассматривают **кураторы.**\n*Можно получить по кнопке в чате <#1104722974491283536>!*\n\n<:tochka2:1105592211497832478> __**Снятие:**__\nПотерять статус крутого игрока ты можешь по этим причинам:\n<:fon:1105454056748626012> Не участвуешь в клозах.\n<:fon:1105454056748626012> Не соответствуешь уровню игры.\n<:fon:1105454056748626012> Неадекватное поведение на клозах.\n\n<:tochka2:1105592211497832478> __**Возможности:**__\n<:fon:1105454056748626012> Дополнительные румы.\n<:fon:1105454056748626012> Доступ в переполненные комнаты клозов.\n\n*Дополнительную информацию ты можешь узнать у <@403574551705026560>.*",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
}
const Nabor = {
    Main: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1171539349582643303/nabor.png?ex=655d0c0b&is=654a970b&hm=ecb48c7370a6405050272aea5d20450152c465e610aa19e0cffaaba6b8ac2f22&="
            }
        },
        {
            "title": "Меню подачи заявок на стафф роли сервера META.",
            "description": "<:hellokitty:1106314830278836264> Чтобы подать заявку, выбери роль снизу, и заполни анкету.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],

    Req: [
        {
            "title": "**ЭМБЕД ПОСТА НАБОРОВ**",
            "color": 11496813,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/1101059416498913340/1119254362997403748/11113.png"
            }
        }
    ],

    Reem: [
        {
            "title": "**Тут находятся эмбеды, которые постятся в набор**",
            "color": 2829617
        }
    ]
}
const roles = {
    Announcement: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1171538031531020309/52623a95ba8c936b.png?ex=655d0ad0&is=654a95d0&hm=9d55b70ef18ff3378364bafe4c0f7644d46d542e12992d32309b7607ab9daaf9&="
            }
        },
        {
            "title": "Роли для получения анонсов мероприятий:",
            "color": 2829617,
            "fields": [
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<:meta_:1140294353395400714> — Анонсы наборов в стафф\n<:kono_:1140293643551379657> — Анонсы кинотеатра\n<:creation:1140294359602970767> — Анонсы творчества\n<:event_2:1140294357002494024> — Анонсы браузерных игр",
                    "inline": true
                },
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<:event:1140294373284782180>— Анонсы настольных игр\n<:close:1140294375788777562> — Анонсы клозов\n<:mafia:1140294365705683044> — Анонсы мафии\n<:bunker:1140294369493135432> — Анонсы бункера",
                    "inline": true
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],

    Game: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1171538031971401788/roles.png?ex=655d0ad0&is=654a95d0&hm=32784668a6586678a91cbda33355300e74494f84d4f2b978f175752f3e4f8d71&="
            }
        },
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1171538032357285949/e82b1d59489098a9.png?ex=655d0ad1&is=654a95d1&hm=b45bf96a67cbbc2384e5c2feaca65c22bc385437b4fbf5b4f259103d909f74d5&="
            }
        },
        {
            "title": "Выбери роль, чтобы проще находить тиммейтов:",
            "color": 2829617,
            "fields": [
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<@&867411616822591528>\n<@&867411578838843433>\n<@&1141778163576340500>",
                    "inline": true
                },
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<@&867411587996057610>\n<@&867411593351397376>",
                    "inline": true
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],

    Custom: [
        {
            "color": 2829617,
            "image": {
                "url": "https://media.discordapp.net/attachments/1129389401630314507/1171538032877371402/8c24cbcd21922b7f.png?ex=655d0ad1&is=654a95d1&hm=9709a5f99ee3ba5905577f805224e345b315892efb9a69d9a85ddcfbf1f7266b&="
            }
        },
        {
            "title": "Информация о основных кастомных ролях сервачка:",
            "color": 2829617,
            "fields": [
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<:ruchki:1141100696926695524> — Товарищ сервера\n<:brainEvent:1140293649159180328> — Эрудированный юзер\n<:vhsClose:1140293630012174356> — Сильный игрок в клозах\n<:vinoBunker:1140305459895615578> — ХС в дискуссионных играх\n<:oblachko:1140293645707247727> — Порядочный человек\n<:microphone:1140294379341357148> — Даббер сервера \n<:music_:1140293634126790808> — Музыкант сервера",
                    "inline": true
                },
                {
                    "name": "<:fon_meta:1105454056748626012>",
                    "value": "<:palette:1140294383472746617> — Художник сервера\n<:book:1140294387293765642> — Чтец сервера\n<:love:1140294363528839241> — Лаврумы\n<:booster:1140293639877173349> — Нитро бустер\n<:picture:1141779766467383438> — Отправлять картинки\n<:selfi:1140293650966921446> — За сигну серверу\n<:kubok_:1140293658042704040> — За победу в глобалке",
                    "inline": true
                }
            ],
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],




    AnRuchki: [
        {
            "description": "<:fon11:832188712644902927>**Информация о роли Товарищ Сервера —** <:handshakingMeta:1110504044495130666>\n\n<:fon11:832188712644902927>**Выдаётся:**\n<a:heartdotmeta00:965684404850679837>Бывшим Кураторам, Модераторам, Администраторам.\n<a:heartdotmeta01:965684412828237934>Людям, которые сделали много для сервера.\n\n<:fon11:832188712644902927>**Снятие:**\n<a:heartdotmeta02:965684420696768512>За грубые нарушения на сервере.\n\n<:fon11:832188712644902927>**Ответственный за выдачу:** <@297372127768870913>",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnCloud: [
        {
            "description": "<:fon:1105454056748626012>**Информация о роли облачка** — <:oblachko:965495296337522688>\n\n<a:dot01:965657669526491186><:oblachko:965495296337522688> — показатель адекватности пользователя, позволяет:\n<:fon11:832188712644902927><a:dot02:965657676719726602>Отправлять картинки и гифки в <#865961833427632138>.\n\n<a:dot03:965657685305483324>**Чтобы получить данную роль:**\n<:fon11:832188712644902927><a:dot04:965657699159261206>Нужно нажать на кнопочку ниже, и заполнить форму.\n\n<a:dot05:965657708164423770>**Обязательная форма заявки:**\n<:fon:1105454056748626012><a:dot07:965657721644937312>Ваше имя и возраст.\n<:fon:1105454056748626012><a:dot08:965657731061145741>Были ли у вас муты/варны/баны.\n<:fon:1105454056748626012><a:dot09:965657745925767228>Кол-во часов в голосовых каналах. (не менее 100 часов)\n<:fon:1105454056748626012><a:dot10:965657753844609115>Точная дата присоединения к серверу. (не менее 30 дней)\n\n<a:dot11:965657760211537921>При нарушении одного из правил, данная роль будет снята.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnErydit: [
        {
            "description": "<:fon11:832188712644902927>\n<@&944556971716149298> — роль мозга хихихахахах вот так вот.\n\n<:fon11:832188712644902927>**Получение:**\n<a:heartdotmeta00:965684404850679837>Выдаётся эта роль за хорошую игру в\n<a:heartdotmeta01:965684412828237934>Codenames и Alias, а так же SiGame.\n<a:heartdotmeta02:965684420696768512>Можно получить по кнопке ниже!\n\n<:fon11:832188712644902927>**Возможности:**\n<a:heartdotmeta00:965684404850679837>Благодаря этой роли ты получишь доступ в закрытый\n<a:heartdotmeta01:965684412828237934>голосовой и текстовый канал Эрудитов!\n\n<:fon11:832188712644902927>**Ивенты для Эрудитов:**\n <a:heartdotmeta00:965684404850679837>Такие ивенты помечаются смайликом \"\\🧠\".\n<a:heartdotmeta01:965684412828237934>Доступ обычным юзерам туда закрыт.\n\n<:fon11:832188712644902927>**Исчезновение:**\n <a:heartdotmeta00:965684404850679837>Забирается ролька за длительное отсутствие на ивентах.\n \n<:fon11:832188712644902927>**Доп инфа у товарища -** <@369403582086119424>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnCloseRole: [
        {
            "description": "<:fon11:832188712644902927><@&1013381038111739914> — да, это те самые потные игроки в такие игры как:\n<:fon11:832188712644902927>Dota 2, League of Legends, Valorant, CS:GO.\n\n<:fon11:832188712644902927>**Получение:** \n<a:heartdotmeta00:965684404850679837>За частую игру в клозы. Заявки рассматривают кураторы.\n<a:heartdotmeta01:965684412828237934>Можно получить по кнопке ниже!\n\n<:fon11:832188712644902927>**Потерять статус крутого игрока ты можешь по причинам:**\n<a:heartdotmeta02:965684420696768512>Не участвуешь в клозах.\n<a:heartdotmeta03:965684428271665182>Не соответствуешь уровню игры.\n<a:heartdotmeta04:965684435741716510>Неадекватное поведение на клозах.\n\n<:fon11:832188712644902927>**Возможности:**\n<a:heartdotmeta05:965684442704269412>Дополнительные румы.\n<a:heartdotmeta06:965684449125761064>Доступ в переполненные комнаты клозов.\n\n<:fon11:832188712644902927>**Ответственный за выдачу:** <@403574551705026560>",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnMafiaRole: [
        {
            "description": "<:fon11:832188712644902927><@&1107361619245285376> — выжившие игроки в мафию или бункер.\n\n<:fon11:832188712644902927>**Получение:** \n<a:heartdotmeta00:965684404850679837>За частую и хорошую игру в мафию или бункер.\n<a:heartdotmeta01:965684412828237934>Заявки рассматривают кураторы.\n\n<:fon11:832188712644902927>**Возможности:**\n<a:heartdotmeta02:965684420696768512>Благодаря этой роли ты получишь доступ в закрытый\n<a:heartdotmeta03:965684428271665182>голосовой и текстовый канал Выживших игроков!\n\n<:fon11:832188712644902927>**Снятие:**\n<a:heartdotmeta04:965684435741716510>Забирается ролька за длительное отсутствие\n<a:heartdotmeta05:965684442704269412>на мафии или бункере.\n\n<:fon11:832188712644902927>**Ответственный за выдачу:** <@699324257636712489>",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnDabber: [
        {
            "description": "<:fon:1105454056748626012> **Информация о роли** - <:mic:965495296341733376>\n\n<a:dot00:965657635691048970>**Роль даббера выдается за умения работать с голосом.**\n<:fon:1105454056748626012><a:dot01:965657669526491186>Даёт возможность говорить в <#957596098267066388>.\n\n<a:dot02:965657676719726602>**Критерии для получения роли:**\n<:fon:1105454056748626012><a:dot03:965657685305483324>Качественный вывод звука;\n<:fon:1105454056748626012><a:dot04:965657699159261206>Хорошее интернет соединение;\n<:fon:1105454056748626012><a:dot05:965657708164423770>Умение контролировать свой голос;\n<:fon:1105454056748626012><a:dot06:965657714787225610>[Согласие с правилами творческого уголка](https://discord.com/channels/822354240713261068/1050134401574502400/1052309872668053565);\n<:fon:1105454056748626012><a:dot07:965657721644937312>Адекватность, отсутствие глобальных нарушений.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnMusic: [
        {
            "description": "<:fon:1105454056748626012>**Информация о роли** - <:music:965495296316563536> \n\n<a:dot00:965657635691048970>**Роль музыканта выдается за музыкальные успехи.**\n<:fon:1105454056748626012><a:dot01:965657669526491186>Даёт возможность говорить в <#1025710195889934426>.\n\n<a:dot02:965657676719726602> **Критерии для получения роли:**\n<:fon:1105454056748626012><a:dot03:965657685305483324>Музыкальные навыки;\n<:fon:1105454056748626012><a:dot04:965657699159261206>Качественный вывод звука;\n<:fon:1105454056748626012><a:dot05:965657708164423770>[Согласие с правилами творческого уголка](https://discord.com/channels/822354240713261068/1025710195889934426/1135207285216510092);\n<:fon:916322554053029938><a:dot06:965657714787225610>Адекватность, отсутствие глобальных нарушений.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnPainter: [
        {
            "description": "<:fon:1105454056748626012> **Информация о роли** - <:artqq:965495296333348865>\n\n<a:dot00:965657635691048970>**Роль художника выдается за художественное мастерство.**\n<:fon:1105454056748626012><a:dot01:965657669526491186>Даёт возможность говорить в <#1025711356902641725>.\n\n<a:dot02:965657676719726602> **Критерии для получения роли:**\n<:fon:1105454056748626012><a:dot03:965657685305483324>Пример своей работы.\n<:fon:1105454056748626012><a:dot04:965657699159261206>Хорошее качество изображения;\n<:fon:1105454056748626012><a:dot05:965657708164423770>[Согласие с правилами публикаций форума](https://discord.com/channels/822354240713261068/1080556877731078154);\n<:fon:1105454056748626012><a:dot05:965657708164423770>Адекватность, отсутствие глобальных нарушений.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnReader: [
        {
            "description": "<:fon:1105454056748626012>**Информация о роли** - <:bookmeta:1026251022466822244>\n\n<a:dot00:965657635691048970>**Роль чтеца выдается за литературные познания.**\n<:fon:1105454056748626012><a:dot01:965657669526491186> Даёт возможность говорить в <#972150826619523112>.\n\n<a:dot02:965657676719726602> **Критерии для получения роли:**\n<:fon:1105454056748626012><a:dot03:965657685305483324> Качественный вывод звука;\n<:fon:1105454056748626012><a:dot04:965657699159261206>Умение контролировать свой голос;\n<:fon:1105454056748626012><a:dot05:965657708164423770>[Согласие с правилами творческого уголка](https://discord.com/channels/822354240713261068/1050132436417261629/1052311146973102140);\n<:fon:1105454056748626012><a:dot06:965657714787225610> Адекватность, отсутствие глобальных нарушений.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnLoveroom: [
        {
            "description": "<:fon11:832188712644902927>**Информация о любовных комнатах —** <:loveroom:965495296119410689>\n\n<:fon11:832188712644902927>**Для создания необходимо:**\n<a:heartdotmeta00:965684404850679837>Написать команду - `!marry <@user/id>` и наличие 1500 <:konfeta_00074:998600817902882826>.\n\n<:fon11:832188712644902927>**Общая информация:**\n<a:heartdotmeta01:965684412828237934>Каждый месяц с баланса пары взимается 1500 <:konfeta_00074:998600817902882826>;\n<a:heartdotmeta02:965684420696768512>Парный онлайн зачисляется, если пара сидит вместе.\n\n<:fon11:832188712644902927>**Подробная информация:**\n<a:heartdotmeta03:965684428271665182>Все команды связанные с любовным комнатами - [тут](https://discord.com/channels/822354240713261068/865919522870919209/1036395278997139476).",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnNitro: [
        {
            "description": "<a:dot01:965657669526491186>На нашем сервере существует роль — <:nitro2:965539708643991593>\n<:fon:1105454056748626012><a:dot02:965657676719726602>Чтобы получить роль, необходимо [бустануть](https://support.discordapp.com/hc/ru/articles/360028038352) наш сервер.\n\n<a:dot03:965657685305483324>Привилегии бустеров:\n<:fon:1105454056748626012><a:dot04:965657699159261206>Отправлять картинки и гифки в <#865961833427632138>\n\n<a:dot05:965657708164423770>Не забудь написать <@297372127768870913>, чтобы забрать 500 <:1_:834832753735893012>.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnKartinki: [
        {
            "description": "<a:dot00:965657635691048970>Данная роль даёт возможность отправлять изображения \n<:fon_meta:1105454056748626012><a:dot01:965657669526491186><#865961833427632138>\n\n<a:dot02:965657676719726602>Для того чтобы получить данную роль, потребуется:\n<:fon_meta:1105454056748626012><a:dot03:965657685305483324>Написать команду </picture:1131516579356626945> и иметь в наличии 1000<:konfeta:1105580295652130936>",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnSigna: [
        {
            "description": "<:fon:1105454056748626012> Информация о **сигне <:selfak:965539198230749194>**\n\n <a:dot01:965657669526491186> **Но прежде чем сделать сигну, ознакомься с правилами:**\n<:fon:1105454056748626012> <a:dot02:965657676719726602> Фотография должна быть в хорошем качестве.\n<:fon:1105454056748626012> <a:dot03:965657685305483324> Фотография должна быть сделана вами.\n<:fon:1105454056748626012> <a:dot04:965657699159261206> Администрация имеет право отклонить публикацию.\n\n <a:dot05:965657708164423770> Повторно награда не выдается.\n<:fon:1105454056748626012> <a:dot06:965657714787225610> Ты получишь соответствующую роль — <:selfak:965539198230749194> и 300 <:konfeta:1105580295652130936>;\n\n<a:dot07:965657721644937312> Публиковать нужно в <#1080915514865504366> с одноименным тегом.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ],
    AnKubok: [
        {
            "description": "<:fon11:832188712644902927>**Информация о роли Кубок —** <:kubok:965495296429801532>\n\n<:fon11:832188712644902927>**Чтобы получить роль необходимо:**\n<a:heartdotmeta00:965684404850679837>Победить в глобальном мероприятии.\n<a:heartdotmeta01:965684412828237934>Больше способов получить нет блина...\n\n<:fon11:832188712644902927>**Снятие:**\n<a:heartdotmeta02:965684420696768512>При победе другого участника в этом же мероприятие.",
            "color": 2829617,
            "image": {
                "url": "https://cdn.discordapp.com/attachments/772218365413818428/1079003352408543302/11112.png"
            }
        }
    ]
}
module.exports = { Utility, Url, Emoji, info, Nabor, roles }